# EmitDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircleLightShape..::..EmitDiameter Property
CircleLightShape Class See Also
---
The emit diameter.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double EmitDiameter { get; set; }
```

Visual Basic
---
```text
Public Property EmitDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double EmitDiameter {
	double get ();
	void set (double value);
}
```

# ### Field Value
The emit diameter as a numerical value in feet between 1.0e-9 and 30000.0
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0. |

# See Also
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace